9ghtX/L6IR_pro/rfu_stm32~/source/rfu_stm32F10x.c
  /* Return the Erase Status */
  return status;
}

/**
  * @brief  Erases all FLASH pages.
  * @note   This function can be used for all STM32F10x devices.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_ERROR_PG,
  *   FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
  */
FLASH_Status RFU_FLASH_EraseAllPages(void)
{
  FLASH_Status status = FLASH_COMPLETE;

#ifdef STM32F10X_XL
  /* Wait for last operation to be completed */
  status = RFU_FLASH_WaitForLastBank1Operation(EraseTimeout);

  if (status == FLASH_COMPLETE) {
    /* if the previous operation is completed, proceed to erase all pages */
    FLASH->CR |= CR_MER_Set;
    FLASH->CR |= CR_STRT_Set;

    /* Wait for last operation to be completed */
    status = RFU_FLASH_WaitForLastBank1Operation(EraseTimeout);
    if (status != FLASH_TIMEOUT) {
      /* if the erase operation is completed, disable the MER Bit */
      FLASH->CR &= CR_MER_Reset;
    }
  }
  if (status == FLASH_COMPLETE) {
    /* if the previous operation is completed, proceed to erase all pages */
    FLASH->CR2 |= CR_MER_Set;
    FLASH->CR2 |= CR_STRT_Set;

    /* Wait for last operation to be completed */
    status = RFU_FLASH_WaitForLastBank2Operation(EraseTimeout);
    if (status != FLASH_TIMEOUT) {
      /* if the erase operation is completed, disable the MER Bit */
      FLASH->CR2 &= CR_MER_Reset;
    }
  }
#else
  /* Wait for last operation to be completed */
  status = RFU_FLASH_WaitForLastOperation(EraseTimeout);
  if (status == FLASH_COMPLETE) {
    /* if the previous operation is completed, proceed to erase all pages */
    FLASH->CR |= CR_MER_Set;
    FLASH->CR |= CR_STRT_Set;

    /* Wait for last operation to be completed */
    status = RFU_FLASH_WaitForLastOperation(EraseTimeout);
    if (status != FLASH_TIMEOUT) {
      /* if the erase operation is completed, disable the MER Bit */
      FLASH->CR &= CR_MER_Reset;
    }
  }
#endif /* STM32F10X_XL */

  /* Return the Erase Status */
  return status;
}

/**
  * @brief  Erases all Bank1 FLASH pages.
  * @note   This function can be used for all STM32F10x devices.
  *         - For STM32F10X_XL devices this function erases all Bank1 pages.
  *         - For all other devices it erases all Bank1 pages and it is
 * equivalent
  *           to FLASH_EraseAllPages function.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_ERROR_PG,
  *   FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
  */
FLASH_Status RFU_FLASH_EraseAllBank1Pages(void)
{
  FLASH_Status status = FLASH_COMPLETE;
  /* Wait for last operation to be completed */
  status = RFU_FLASH_WaitForLastBank1Operation(EraseTimeout);

  if (status == FLASH_COMPLETE) {
    /* if the previous operation is completed, proceed to erase all pages */
    FLASH->CR |= CR_MER_Set;
    FLASH->CR |= CR_STRT_Set;

    /* Wait for last operation to be completed */
    status = RFU_FLASH_WaitForLastBank1Operation(EraseTimeout);
    if (status != FLASH_TIMEOUT) {
      /* if the erase operation is completed, disable the MER Bit */
      FLASH->CR &= CR_MER_Reset;
    }
  }
  /* Return the Erase Status */
  return status;
}

#ifdef STM32F10X_XL
/**
  * @brief  Erases all Bank2 FLASH pages.
  * @note   This function can be used only for STM32F10x_XL density devices.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_ERROR_PG,
  *   FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
  */
FLASH_Status RFU_FLASH_EraseAllBank2Pages(void)
{
  FLASH_Status status = FLASH_COMPLETE;
  /* Wait for last operation to be completed */
  status = RFU_FLASH_WaitForLastBank2Operation(EraseTimeout);

  if (status == FLASH_COMPLETE) {
    /* if the previous operation is completed, proceed to erase all pages */
    FLASH->CR2 |= CR_MER_Set;
    FLASH->CR2 |= CR_STRT_Set;

    /* Wait for last operation to be completed */
    status = RFU_FLASH_WaitForLastBank2Operation(EraseTimeout);
    if (status != FLASH_TIMEOUT) {
      /* if the erase operation is completed, disable the MER Bit */
      FLASH->CR2 &= CR_MER_Reset;
    }
  }
  /* Return the Erase Status */
  return status;
}
#endif /* STM32F10X_XL */

/**
  * @brief  Erases the FLASH option bytes.
  * @note   This functions erases all option bytes except the Read protection
 * (RDP).
  * @note   This function can be used for all STM32F10x devices.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_ERROR_PG,
  *   FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
  */
FLASH_Status RFU_FLASH_EraseOptionBytes(void)
{
  uint16_t rdptmp = RDP_Key;

  FLASH_Status status = FLASH_COMPLETE;

  /* Get the actual read protection Option Byte value */
  if (RFU_FLASH_GetReadOutProtectionStatus() != RESET) {
    rdptmp = 0x00;
  }

  /* Wait for last operation to be completed */
  status = RFU_FLASH_WaitForLastOperation(EraseTimeout);
  if (status == FLASH_COMPLETE) {
    /* Authorize the small information block programming */
    FLASH->OPTKEYR = FLASH_KEY1;
    FLASH->OPTKEYR = FLASH_KEY2;

    /* if the previous operation is completed, proceed to erase the option bytes
     */
    FLASH->CR |= CR_OPTER_Set;
    FLASH->CR |= CR_STRT_Set;
    /* Wait for last operation to be completed */
    status = RFU_FLASH_WaitForLastOperation(EraseTimeout);

    if (status == FLASH_COMPLETE) {
      /* if the erase operation is completed, disable the OPTER Bit */
      FLASH->CR &= CR_OPTER_Reset;

      /* Enable the Option Bytes Programming operation */
      FLASH->CR |= CR_OPTPG_Set;
      /* Restore the last read protection Option Byte value */
      OB->RDP = (uint16_t)rdptmp;
      /* Wait for last operation to be completed */
      status = RFU_FLASH_WaitForLastOperation(ProgramTimeout);

      if (status != FLASH_TIMEOUT) {
        /* if the program operation is completed, disable the OPTPG Bit */
        FLASH->CR &= CR_OPTPG_Reset;
      }
    } else {
      if (status != FLASH_TIMEOUT) {
        /* Disable the OPTPG Bit */
        FLASH->CR &= CR_OPTPG_Reset;
      }
    }
  }
  /* Return the erase status */
  return status;
}

/**
  * @brief  Programs a word at a specified address.
  * @note   This function can be used for all STM32F10x devices.
  * @param  Address: specifies the address to be programmed.
  * @param  Data: specifies the data to be programmed.
  * @retval FLASH Status: The returned value can be: FLASH_ERROR_PG,
  *   FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
  */
FLASH_Status RFU_FLASH_ProgramWord(uint32_t Address, uint32_t Data)
{
  FLASH_Status status = FLASH_COMPLETE;
  __IO uint32_t tmp = 0;

  /* Check the parameters */
  assert_param(IS_FLASH_ADDRESS(Address));

