9ghtX/L6IR_pro/rfu_stm32~/source/rfu_stm32F10x.c
#ifdef STM32F10X_XL
  if (Address < FLASH_BANK1_END_ADDRESS - 2) {
    /* Wait for last operation to be completed */
    status = RFU_FLASH_WaitForLastBank1Operation(ProgramTimeout);
    if (status == FLASH_COMPLETE) {
      /* if the previous operation is completed, proceed to program the new
        first
        half word */
      FLASH->CR |= CR_PG_Set;

      *(__IO uint16_t *)Address = (uint16_t)Data;
      /* Wait for last operation to be completed */
      status = RFU_FLASH_WaitForLastOperation(ProgramTimeout);

      if (status == FLASH_COMPLETE) {
        /* if the previous operation is completed, proceed to program the new
        second
        half word */
        tmp = Address + 2;

        *(__IO uint16_t *)tmp = Data >> 16;

        /* Wait for last operation to be completed */
        status = RFU_FLASH_WaitForLastOperation(ProgramTimeout);

        if (status != FLASH_TIMEOUT) {
          /* Disable the PG Bit */
          FLASH->CR &= CR_PG_Reset;
        }
      } else {
        if (status != FLASH_TIMEOUT) {
          /* Disable the PG Bit */
          FLASH->CR &= CR_PG_Reset;
        }
      }
    }
  } else if (Address == (FLASH_BANK1_END_ADDRESS - 1)) {
    /* Wait for last operation to be completed */
    status = RFU_FLASH_WaitForLastBank1Operation(ProgramTimeout);

    if (status == FLASH_COMPLETE) {
      /* if the previous operation is completed, proceed to program the new
        first
        half word */
      FLASH->CR |= CR_PG_Set;

      *(__IO uint16_t *)Address = (uint16_t)Data;

      /* Wait for last operation to be completed */
      status = FLASH_WaitForLastBank1Operation(ProgramTimeout);

      if (status != FLASH_TIMEOUT) {
        /* Disable the PG Bit */
        FLASH->CR &= CR_PG_Reset;
      }
    } else {
      if (status != FLASH_TIMEOUT) {
        /* Disable the PG Bit */
        FLASH->CR &= CR_PG_Reset;
      }
    }

    /* Wait for last operation to be completed */
    status = RFU_FLASH_WaitForLastBank2Operation(ProgramTimeout);

    if (status == FLASH_COMPLETE) {
      /* if the previous operation is completed, proceed to program the new
      second
      half word */
      FLASH->CR2 |= CR_PG_Set;
      tmp = Address + 2;

      *(__IO uint16_t *)tmp = Data >> 16;

      /* Wait for last operation to be completed */
      status = RFU_FLASH_WaitForLastBank2Operation(ProgramTimeout);

      if (status != FLASH_TIMEOUT) {
        /* Disable the PG Bit */
        FLASH->CR2 &= CR_PG_Reset;
      }
    } else {
      if (status != FLASH_TIMEOUT) {
        /* Disable the PG Bit */
        FLASH->CR2 &= CR_PG_Reset;
      }
    }
  } else {
    /* Wait for last operation to be completed */
    status = RFU_FLASH_WaitForLastBank2Operation(ProgramTimeout);

    if (status == FLASH_COMPLETE) {
      /* if the previous operation is completed, proceed to program the new
        first
        half word */
      FLASH->CR2 |= CR_PG_Set;

      *(__IO uint16_t *)Address = (uint16_t)Data;
      /* Wait for last operation to be completed */
      status = RFU_FLASH_WaitForLastBank2Operation(ProgramTimeout);

      if (status == FLASH_COMPLETE) {
        /* if the previous operation is completed, proceed to program the new
        second
        half word */
        tmp = Address + 2;

        *(__IO uint16_t *)tmp = Data >> 16;

        /* Wait for last operation to be completed */
        status = RFU_FLASH_WaitForLastBank2Operation(ProgramTimeout);

        if (status != FLASH_TIMEOUT) {
          /* Disable the PG Bit */
          FLASH->CR2 &= CR_PG_Reset;
        }
      } else {
        if (status != FLASH_TIMEOUT) {
          /* Disable the PG Bit */
          FLASH->CR2 &= CR_PG_Reset;
        }
      }
    }
  }
#else
  /* Wait for last operation to be completed */
  status = RFU_FLASH_WaitForLastOperation(ProgramTimeout);

  if (status == FLASH_COMPLETE) {
    /* if the previous operation is completed, proceed to program the new first
    half word */
    FLASH->CR |= CR_PG_Set;

    *(__IO uint16_t *)Address = (uint16_t)Data;
    /* Wait for last operation to be completed */
    status = RFU_FLASH_WaitForLastOperation(ProgramTimeout);

    if (status == FLASH_COMPLETE) {
      /* if the previous operation is completed, proceed to program the new
      second
      half word */
      tmp = Address + 2;

      *(__IO uint16_t *)tmp = Data >> 16;

      /* Wait for last operation to be completed */
      status = RFU_FLASH_WaitForLastOperation(ProgramTimeout);

      if (status != FLASH_TIMEOUT) {
        /* Disable the PG Bit */
        FLASH->CR &= CR_PG_Reset;
      }
    } else {
      if (status != FLASH_TIMEOUT) {
        /* Disable the PG Bit */
        FLASH->CR &= CR_PG_Reset;
      }
    }
  }
#endif /* STM32F10X_XL */

  /* Return the Program Status */
  return status;
}

/**
  * @brief  Programs a half word at a specified address.
  * @note   This function can be used for all STM32F10x devices.
  * @param  Address: specifies the address to be programmed.
  * @param  Data: specifies the data to be programmed.
  * @retval FLASH Status: The returned value can be: FLASH_ERROR_PG,
  *   FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
  */
FLASH_Status RFU_FLASH_ProgramHalfWord(uint32_t Address, uint16_t Data)
{
  FLASH_Status status = FLASH_COMPLETE;
  /* Check the parameters */
  assert_param(IS_FLASH_ADDRESS(Address));

#ifdef STM32F10X_XL
  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation(ProgramTimeout);

  if (Address < FLASH_BANK1_END_ADDRESS) {
    if (status == FLASH_COMPLETE) {
      /* if the previous operation is completed, proceed to program the new data
       */
      FLASH->CR |= CR_PG_Set;

      *(__IO uint16_t *)Address = Data;
      /* Wait for last operation to be completed */
      status = RFU_FLASH_WaitForLastBank1Operation(ProgramTimeout);
      if (status != FLASH_TIMEOUT) {
        /* if the program operation is completed, disable the PG Bit */
        FLASH->CR &= CR_PG_Reset;
      }
    }
  } else {
    if (status == FLASH_COMPLETE) {
      /* if the previous operation is completed, proceed to program the new data
       */
      FLASH->CR2 |= CR_PG_Set;

      *(__IO uint16_t *)Address = Data;
      /* Wait for last operation to be completed */
      status = RFU_FLASH_WaitForLastBank2Operation(ProgramTimeout);
      if (status != FLASH_TIMEOUT) {
        /* if the program operation is completed, disable the PG Bit */
        FLASH->CR2 &= CR_PG_Reset;
      }
    }
  }
#else
  /* Wait for last operation to be completed */
  status = RFU_FLASH_WaitForLastOperation(ProgramTimeout);

  if (status == FLASH_COMPLETE) {
    /* if the previous operation is completed, proceed to program the new data
     */
    FLASH->CR |= CR_PG_Set;

    *(__IO uint16_t *)Address = Data;
    /* Wait for last operation to be completed */
    status = RFU_FLASH_WaitForLastOperation(ProgramTimeout);
    if (status != FLASH_TIMEOUT) {
      /* if the program operation is completed, disable the PG Bit */
      FLASH->CR &= CR_PG_Reset;
    }
  }
#endif /* STM32F10X_XL */

  /* Return the Program Status */
  return status;
}

/**
  * @brief  Programs a half word at a specified Option Byte Data address.
  * @note   This function can be used for all STM32F10x devices.
  * @param  Address: specifies the address to be programmed.
  *   This parameter can be 0x1FFFF804 or 0x1FFFF806.
  * @param  Data: specifies the data to be programmed.
  * @retval FLASH Status: The returned value can be: FLASH_ERROR_PG,
  *   FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
  */
FLASH_Status RFU_FLASH_ProgramOptionByteData(uint32_t Address, uint8_t Data)
{
  FLASH_Status status = FLASH_COMPLETE;
  /* Check the parameters */
  assert_param(IS_OB_DATA_ADDRESS(Address));
  status = FLASH_WaitForLastOperation(ProgramTimeout);

  if (status == FLASH_COMPLETE) {
    /* Authorize the small information block programming */
    FLASH->OPTKEYR = FLASH_KEY1;
    FLASH->OPTKEYR = FLASH_KEY2;
    /* Enables the Option Bytes Programming operation */
    FLASH->CR |= CR_OPTPG_Set;
    *(__IO uint16_t *)Address = Data;

    /* Wait for last operation to be completed */
    status = FLASH_WaitForLastOperation(ProgramTimeout);
    if (status != FLASH_TIMEOUT) {
      /* if the program operation is completed, disable the OPTPG Bit */
      FLASH->CR &= CR_OPTPG_Reset;
    }
  }
  /* Return the Option Byte Data Program Status */
  return status;
}

/**
  * @brief  Write protects the desired pages
  * @note   This function can be used for all STM32F10x devices.
  * @param  FLASH_Pages: specifies the address of the pages to be write
 * protected.
  *   This parameter can be:
  *     @arg For @b STM32_Low-density_devices: value between
 * FLASH_WRProt_Pages0to3 and FLASH_WRProt_Pages28to31
  *     @arg For @b STM32_Medium-density_devices: value between
 * FLASH_WRProt_Pages0to3
  *       and FLASH_WRProt_Pages124to127
  *     @arg For @b STM32_High-density_devices: value between
 * FLASH_WRProt_Pages0to1 and
  *       FLASH_WRProt_Pages60to61 or FLASH_WRProt_Pages62to255
  *     @arg For @b STM32_Connectivity_line_devices: value between
 * FLASH_WRProt_Pages0to1 and
  *       FLASH_WRProt_Pages60to61 or FLASH_WRProt_Pages62to127
  *     @arg For @b STM32_XL-density_devices: value between
 * FLASH_WRProt_Pages0to1 and
  *       FLASH_WRProt_Pages60to61 or FLASH_WRProt_Pages62to511
  *     @arg FLASH_WRProt_AllPages
  * @retval FLASH Status: The returned value can be: FLASH_ERROR_PG,
  *   FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
  */
FLASH_Status RFU_FLASH_EnableWriteProtection(uint32_t FLASH_Pages)
{
  uint16_t WRP0_Data = 0xFFFF, WRP1_Data = 0xFFFF, WRP2_Data = 0xFFFF,
           WRP3_Data = 0xFFFF;

