9ghtX/L6IR_pro/rfu_stm32~/source/rfu_stm32F10x.c
  if ((FLASH->ACR & ACR_PRFTBS_Mask) != (uint32_t)RESET) {
    bitstatus = SET;
  } else {
    bitstatus = RESET;
  }
  /* Return the new state of FLASH Prefetch Buffer Status (SET or RESET) */
  return bitstatus;
}

/**
  * @brief  Enables or disables the specified FLASH interrupts.
  * @note   This function can be used for all STM32F10x devices.
  *         - For STM32F10X_XL devices, enables or disables the specified FLASH
  interrupts
              for Bank1 and Bank2.
  *         - For other devices it enables or disables the specified FLASH
  interrupts for Bank1.
  * @param  FLASH_IT: specifies the FLASH interrupt sources to be enabled or
  disabled.
  *   This parameter can be any combination of the following values:
  *     @arg FLASH_IT_ERROR: FLASH Error Interrupt
  *     @arg FLASH_IT_EOP: FLASH end of operation Interrupt
  * @param  NewState: new state of the specified Flash interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void RFU_FLASH_ITConfig(uint32_t FLASH_IT, FunctionalState NewState)
{
#ifdef STM32F10X_XL
  /* Check the parameters */
  assert_param(IS_FLASH_IT(FLASH_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if ((FLASH_IT & 0x80000000) != 0x0) {
    if (NewState != DISABLE) {
      /* Enable the interrupt sources */
      FLASH->CR2 |= (FLASH_IT & 0x7FFFFFFF);
    } else {
      /* Disable the interrupt sources */
      FLASH->CR2 &= ~(uint32_t)(FLASH_IT & 0x7FFFFFFF);
    }
  } else {
    if (NewState != DISABLE) {
      /* Enable the interrupt sources */
      FLASH->CR |= FLASH_IT;
    } else {
      /* Disable the interrupt sources */
      FLASH->CR &= ~(uint32_t)FLASH_IT;
    }
  }
#else
  /* Check the parameters */
  assert_param(IS_FLASH_IT(FLASH_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE) {
    /* Enable the interrupt sources */
    FLASH->CR |= FLASH_IT;
  } else {
    /* Disable the interrupt sources */
    FLASH->CR &= ~(uint32_t)FLASH_IT;
  }
#endif /* STM32F10X_XL */
}

/**
  * @brief  Checks whether the specified FLASH flag is set or not.
  * @note   This function can be used for all STM32F10x devices.
  *         - For STM32F10X_XL devices, this function checks whether the
 * specified
  *           Bank1 or Bank2 flag is set or not.
  *         - For other devices, it checks whether the specified Bank1 flag is
  *           set or not.
  * @param  FLASH_FLAG: specifies the FLASH flag to check.
  *   This parameter can be one of the following values:
  *     @arg FLASH_FLAG_BSY: FLASH Busy flag
  *     @arg FLASH_FLAG_PGERR: FLASH Program error flag
  *     @arg FLASH_FLAG_WRPRTERR: FLASH Write protected error flag
  *     @arg FLASH_FLAG_EOP: FLASH End of Operation flag
  *     @arg FLASH_FLAG_OPTERR:  FLASH Option Byte error flag
  * @retval The new state of FLASH_FLAG (SET or RESET).
  */
FlagStatus RFU_FLASH_GetFlagStatus(uint32_t FLASH_FLAG)
{
  FlagStatus bitstatus = RESET;

#ifdef STM32F10X_XL
  /* Check the parameters */
  assert_param(IS_FLASH_GET_FLAG(FLASH_FLAG));
  if (FLASH_FLAG == FLASH_FLAG_OPTERR) {
    if ((FLASH->OBR & FLASH_FLAG_OPTERR) != (uint32_t)RESET) {
      bitstatus = SET;
    } else {
      bitstatus = RESET;
    }
  } else {
    if ((FLASH_FLAG & 0x80000000) != 0x0) {
      if ((FLASH->SR2 & FLASH_FLAG) != (uint32_t)RESET) {
        bitstatus = SET;
      } else {
        bitstatus = RESET;
      }
    } else {
      if ((FLASH->SR & FLASH_FLAG) != (uint32_t)RESET) {
        bitstatus = SET;
      } else {
        bitstatus = RESET;
      }
    }
  }
#else
  /* Check the parameters */
  assert_param(IS_FLASH_GET_FLAG(FLASH_FLAG));
  if (FLASH_FLAG == FLASH_FLAG_OPTERR) {
    if ((FLASH->OBR & FLASH_FLAG_OPTERR) != (uint32_t)RESET) {
      bitstatus = SET;
    } else {
      bitstatus = RESET;
    }
  } else {
    if ((FLASH->SR & FLASH_FLAG) != (uint32_t)RESET) {
      bitstatus = SET;
    } else {
      bitstatus = RESET;
    }
  }
#endif /* STM32F10X_XL */

  /* Return the new state of FLASH_FLAG (SET or RESET) */
  return bitstatus;
}

/**
  * @brief  Clears the FLASH’s pending flags.
  * @note   This function can be used for all STM32F10x devices.
  *         - For STM32F10X_XL devices, this function clears Bank1 or Bank2’s
 * pending flags
  *         - For other devices, it clears Bank1’s pending flags.
  * @param  FLASH_FLAG: specifies the FLASH flags to clear.
  *   This parameter can be any combination of the following values:
  *     @arg FLASH_FLAG_PGERR: FLASH Program error flag
  *     @arg FLASH_FLAG_WRPRTERR: FLASH Write protected error flag
  *     @arg FLASH_FLAG_EOP: FLASH End of Operation flag
  * @retval None
  */
void RFU_FLASH_ClearFlag(uint32_t FLASH_FLAG)
{
#ifdef STM32F10X_XL
  /* Check the parameters */
  assert_param(IS_FLASH_CLEAR_FLAG(FLASH_FLAG));

  if ((FLASH_FLAG & 0x80000000) != 0x0) {
    /* Clear the flags */
    FLASH->SR2 = FLASH_FLAG;
  } else {
    /* Clear the flags */
    FLASH->SR = FLASH_FLAG;
  }

#else
  /* Check the parameters */
  assert_param(IS_FLASH_CLEAR_FLAG(FLASH_FLAG));

  /* Clear the flags */
  FLASH->SR = FLASH_FLAG;
#endif /* STM32F10X_XL */
}

/**
  * @brief  Returns the FLASH Status.
  * @note   This function can be used for all STM32F10x devices, it is
 * equivalent
  *    to FLASH_GetBank1Status function.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
  *   FLASH_ERROR_WRP or FLASH_COMPLETE
  */
FLASH_Status RFU_FLASH_GetStatus(void)
{
  FLASH_Status flashstatus = FLASH_COMPLETE;

  if ((FLASH->SR & FLASH_FLAG_BSY) == FLASH_FLAG_BSY) {
    flashstatus = FLASH_BUSY;
  } else {
    if ((FLASH->SR & FLASH_FLAG_PGERR) != 0) {
      flashstatus = FLASH_ERROR_PG;
    } else {
      if ((FLASH->SR & FLASH_FLAG_WRPRTERR) != 0) {
        flashstatus = FLASH_ERROR_WRP;
      } else {
        flashstatus = FLASH_COMPLETE;
      }
    }
  }
  /* Return the Flash Status */
  return flashstatus;
}

/**
  * @brief  Returns the FLASH Bank1 Status.
  * @note   This function can be used for all STM32F10x devices, it is
 * equivalent
  *   to FLASH_GetStatus function.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
  *   FLASH_ERROR_WRP or FLASH_COMPLETE
  */
FLASH_Status RFU_FLASH_GetBank1Status(void)
{
  FLASH_Status flashstatus = FLASH_COMPLETE;

  if ((FLASH->SR & FLASH_FLAG_BANK1_BSY) == FLASH_FLAG_BSY) {
    flashstatus = FLASH_BUSY;
  } else {
    if ((FLASH->SR & FLASH_FLAG_BANK1_PGERR) != 0) {
      flashstatus = FLASH_ERROR_PG;
    } else {
      if ((FLASH->SR & FLASH_FLAG_BANK1_WRPRTERR) != 0) {
        flashstatus = FLASH_ERROR_WRP;
      } else {
        flashstatus = FLASH_COMPLETE;
      }
    }
  }
  /* Return the Flash Status */
  return flashstatus;
}

