9ghtX/L6IR_pro/rfu_stm32~/source/rfu_stm32F10x.c
#ifdef STM32F10X_XL
/**
  * @brief  Returns the FLASH Bank2 Status.
  * @note   This function can be used for STM32F10x_XL density devices.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PG,
  *   FLASH_ERROR_WRP or FLASH_COMPLETE
  */
FLASH_Status RFU_FLASH_GetBank2Status(void)
{
  FLASH_Status flashstatus = FLASH_COMPLETE;

  if ((FLASH->SR2 & (FLASH_FLAG_BANK2_BSY & 0x7FFFFFFF)) ==
      (FLASH_FLAG_BANK2_BSY & 0x7FFFFFFF)) {
    flashstatus = FLASH_BUSY;
  } else {
    if ((FLASH->SR2 & (FLASH_FLAG_BANK2_PGERR & 0x7FFFFFFF)) != 0) {
      flashstatus = FLASH_ERROR_PG;
    } else {
      if ((FLASH->SR2 & (FLASH_FLAG_BANK2_WRPRTERR & 0x7FFFFFFF)) != 0) {
        flashstatus = FLASH_ERROR_WRP;
      } else {
        flashstatus = FLASH_COMPLETE;
      }
    }
  }
  /* Return the Flash Status */
  return flashstatus;
}
#endif /* STM32F10X_XL */
       /**
         * @brief  Waits for a Flash operation to complete or a TIMEOUT to occur.
         * @note   This function can be used for all STM32F10x devices,
         *         it is equivalent to FLASH_WaitForLastBank1Operation.
         *         - For STM32F10X_XL devices this function waits for a Bank1 Flash
        * operation
         *           to complete or a TIMEOUT to occur.
         *         - For all other devices it waits for a Flash operation to complete
         *           or a TIMEOUT to occur.
         * @param  Timeout: FLASH progamming Timeout
         * @retval FLASH Status: The returned value can be: FLASH_ERROR_PG,
         *   FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
         */
FLASH_Status RFU_FLASH_WaitForLastOperation(uint32_t Timeout)
{
  FLASH_Status status = FLASH_COMPLETE;

  /* Check for the Flash Status */
  status = RFU_FLASH_GetBank1Status();
  /* Wait for a Flash operation to complete or a TIMEOUT to occur */
  while ((status == FLASH_BUSY) && (Timeout != 0x00)) {
    status = RFU_FLASH_GetBank1Status();
    Timeout--;
  }
  if (Timeout == 0x00) {
    status = FLASH_TIMEOUT;
  }
  /* Return the operation status */
  return status;
}

/**
  * @brief  Waits for a Flash operation on Bank1 to complete or a TIMEOUT to
 * occur.
  * @note   This function can be used for all STM32F10x devices,
  *         it is equivalent to FLASH_WaitForLastOperation.
  * @param  Timeout: FLASH progamming Timeout
  * @retval FLASH Status: The returned value can be: FLASH_ERROR_PG,
  *   FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
  */
FLASH_Status RFU_FLASH_WaitForLastBank1Operation(uint32_t Timeout)
{
  FLASH_Status status = FLASH_COMPLETE;

  /* Check for the Flash Status */
  status = RFU_FLASH_GetBank1Status();
  /* Wait for a Flash operation to complete or a TIMEOUT to occur */
  while ((status == FLASH_FLAG_BANK1_BSY) && (Timeout != 0x00)) {
    status = RFU_FLASH_GetBank1Status();
    Timeout--;
  }
  if (Timeout == 0x00) {
    status = FLASH_TIMEOUT;
  }
  /* Return the operation status */
  return status;
}

#ifdef STM32F10X_XL
/**
  * @brief  Waits for a Flash operation on Bank2 to complete or a TIMEOUT to
 * occur.
  * @note   This function can be used only for STM32F10x_XL density devices.
  * @param  Timeout: FLASH progamming Timeout
  * @retval FLASH Status: The returned value can be: FLASH_ERROR_PG,
  *   FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
  */
FLASH_Status RFU_FLASH_WaitForLastBank2Operation(uint32_t Timeout)
{
  FLASH_Status status = FLASH_COMPLETE;

  /* Check for the Flash Status */
  status = RFU_FLASH_GetBank2Status();
  /* Wait for a Flash operation to complete or a TIMEOUT to occur */
  while ((status == (FLASH_FLAG_BANK2_BSY & 0x7FFFFFFF)) && (Timeout != 0x00)) {
    status = RFU_RFU_FLASH_GetBank2Status();
    Timeout--;
  }
  if (Timeout == 0x00) {
    status = FLASH_TIMEOUT;
  }
  /* Return the operation status */
  return status;
}
#endif /* STM32F10X_XL */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif
/******************* (C) COPYRIGHT 2010 STMicroelectronics *****END OF FILE****/
